# BuildingPadNoSurfaceError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..BuildingPadNoSurfaceError Property
BuiltInFailures..::..SketchFailures Class See Also
---
A Pad can't extend beyond the edge of a Toposurface.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BuildingPadNoSurfaceError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BuildingPadNoSurfaceError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BuildingPadNoSurfaceError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace